% 巴恩斯利蕨类(Barnsley fern)使用了混沌活动。
% 自然形态（蕨类植物、云、山脉等）可以通过迭代函数系统（IFS）重新创建

function fenxingfernifs()
% 绘制巴恩斯利蕨类

% 定义函数
f1 = @(x,y) [0 0.00;0.00 0.16]*[x;y];
f2 = @(x,y) [0.85 0.04;-0.04 0.85]*[x;y]+[0;1.60];
f3 = @(x,y) [0.20 -0.26;0.23 0.22]*[x;y]+[0;1.60];
f4 = @(x,y) [-0.15 0.28;0.26 0.24]*[x;y]+[0;0.44];

% 权重
w = [0.01 0.85 0.07 0.07];

% 设置初始点和迭代次数
n = 1000000;
x = zeros(2, n);
x(:, 1) = [0; 0];

% 迭代
for i = 2:n
    r = rand();
    if r < w(1)
        x(:, i) = f1(x(1, i-1), x(2, i-1));
    elseif r < w(1) + w(2)
        x(:, i) = f2(x(1, i-1), x(2, i-1));
    elseif r < w(1) + w(2) + w(3)
        x(:, i) = f3(x(1, i-1), x(2, i-1));
    else
        x(:, i) = f4(x(1, i-1), x(2, i-1));
    end
end

% 绘制结果
plot(x(1,:), x(2,:), '.', 'MarkerSize',1);
set(gca,'Color',[1 1 1],'XTick',[],'YTick',[]);
axis([-3 3 0 10]);
xlabel(' ');
ylabel(' ');
title('巴恩斯利蕨类');
end